Show / Hide Table of Contents
Class ReinfBarByPolyline
Representing reinforcement bar input by polyline in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarByPolyline
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarByPolyline : ReinforcementGroup
Constructors
Improve this Doc   View Source
ReinfBarByPolyline()
Constructor
Declaration
public ReinfBarByPolyline()
Properties
Improve this Doc   View Source
BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
Declaration
public Vector3D BarDistance { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
BarShape
Polyline representing shape of bar
Declaration
public ReferenceElement BarShape { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Distance
Distance between reinforcement layers
Declaration
public double Distance { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Master component of reinforcement
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterPoint
Master point of reinforcement
Declaration
public int MasterPoint { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
NumOfLayers
Number of layers
Declaration
public int NumOfLayers { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Position
Offset between master point and first point of BarShape
Declaration
public Vector3D Position { get; set; }
Property Value
 Type |  Description
 Vector3D
 Improve this Doc
 View Source